nxp-mcuxpresso/mcux-soc-svd/KW45Z41053/KW45Z41053.xml
        <register>
          <name>SID</name>
          <description>System ID</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>QI</name>
              <description>Qual Info</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>industrial</name>
                  <description>Industrial</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>auto</name>
                  <description>Auto</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIREV</name>
              <description>Silicon Revision</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spin2nd</name>
                  <description>2nd Major Spin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spin1st</name>
                  <description>1st Major Spin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init</name>
                  <description>Initial mask set</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINID</name>
              <description>Pin Identification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pin40</name>
                  <description>40HVQFN</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin48</name>
                  <description>48HVQFN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin56</name>
                  <description>56HVQFN</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>CMP Presence</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No CMP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>CMP present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLXIO</name>
              <description>FlexIO Presence</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No FlexIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>FlexIO present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF</name>
              <description>VREF Presence</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No VREF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>VREF present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C</name>
              <description>I3C Presence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No I3C</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>I3C present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN</name>
              <description>CAN Presence</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No CAN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>CAN present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure Enclave Presence</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>No Secure Enclave</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>Secure Enclave present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMSZ</name>
              <description>RAM Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size96k</name>
                  <description>96 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size128k</name>
                  <description>128 KB</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSZ</name>
              <description>Flash Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size1mb</name>
                  <description>1 MB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size512kb</name>
                  <description>512 KB</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEF</name>
              <description>Bluetooth LE Feature</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noble</name>
                  <description>No Bluetooth LE present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5dot1</name>
                  <description>Bluetooth LE 5.1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5dot2</name>
                  <description>Bluetooth LE 5.2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5dot3</name>
                  <description>Bluetooth LE 5.3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>upgr</name>
                  <description>Bluetooth LE Upgrade</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADIOF</name>
              <description>Radio Feature</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>802.15.4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Bluetooth LE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Bluetooth LE + 15.4</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAMID</name>
              <description>Family ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>k4w1</name>
                  <description>K4W1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
