nxp-mcuxpresso/mcux-soc-svd/KW45Z41053/KW45Z41053.xml
        <register>
          <name>PMC</name>
          <description>Pin Mode Configuration</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPMC0</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC2</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC3</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC4</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC5</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC7</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC8</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC9</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC10</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC11</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC12</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC13</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC14</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC15</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC27</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC28</name>
              <description>Wakeup pin mode configuration for WUU_Pn</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. Software can modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Software must not modify the corresponding fields within the Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn) registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <description>Pin Filter Mode Configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTM1</name>
              <description>Filter Mode for FILTn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during Deep Sleep/Power Down mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTM2</name>
              <description>Filter Mode for FILTn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during Deep Sleep/Power Down mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
