nxp-mcuxpresso/mcux-soc-svd/KW45Z41053/KW45Z41053.xml
        <register>
          <name>MRCC_PORTC</name>
          <description>PORTC Reset and Clock Control</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPADC0</name>
          <description>ADC0 Reset and Clock Control</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clkroot_func_0</name>
                  <description>The clock is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkroot_func_2</name>
                  <description>FRO-6M</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkroot_func_3</name>
                  <description>FRO-192M</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkroot_func_4</name>
                  <description>SOSC-CLK</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPCMP0</name>
          <description>LPCMP0 Reset and Clock Control</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPCMP1</name>
          <description>LPCMP1 Reset and Clock Control</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_VREF0</name>
          <description>VREF0 Reset and Clock Control</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_GPIOA</name>
          <description>GPIOA Reset and Clock Control</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_GPIOB</name>
          <description>GPIOB Reset and Clock Control</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled; module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled; module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module is idle.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset Negation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETING</name>
                  <description>Module is held in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module released from reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Peripheral Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module is not present; writes to this register are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
