nxp-mcuxpresso/mcux-soc-svd/KW45Z41053/KW45Z41053.xml
        <register>
          <name>CONF</name>
          <description>Configuration</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOZEEN</name>
              <description>Doze Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Internal TPM counter continues.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_COUNT</name>
                  <description>Internal TPM counter is paused and does not increment. Trigger inputs and input capture events are ignored, and PWM outputs are forced to their default state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGMODE</name>
              <description>Debug Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COUNT</name>
                  <description>TPM counter is paused and does not increment. Trigger inputs and input capture events are ignored, and PWM outputs are forced to their default state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>TPM counter continues.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTBEEN</name>
              <description>Global time base enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>All channels use the internally generated TPM counter as their timebase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>All channels use an externally generated global timebase as their timebase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BRIC</name>
      <description>BRIC</description>
      <groupName>BRIC</groupName>
      <baseAddress>0x48A06700</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>KEY0_[%s]</name>
          <description>KEY0 Registers (PKB)</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY0_x</name>
              <description>KEY0 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_0</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_1</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_2</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_3</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRIC_CONFIG</name>
          <description>BRIC CONFIG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY_INDEX</name>
              <description>KEY INDEX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPS_XFR_ERR_EN</name>
              <description>Enable (0x1) ips_xfr_err generation on IPS access during HW mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPS_XFR_WAIT_EN</name>
              <description>Enable (0x1) ips_xfr_wait generation on IPS access during HW mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HI_MODE</name>
              <description>Indicates HW mode request to BRIC is active</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HI_READY</name>
              <description>Indicates HW mode is in progress and any SW access during this time is responded with an IPS_ERROR or IPS_WAIT depending on the configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PKB_ERR_RESP</name>
              <description>Disable (0x1) PKB error response (Error response will be forced to zero)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
